[
  {
    "title": "How will you improve the worst customer experience post a successful order placement on Instacart?",
    "companies": [
      "other",
      "doordash"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "How would you increase the monetization of Farmville over and above the current features by 10-15%?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "What would be your roadmap if you were the PM of JIRA?",
    "companies": [
      "atlassian"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "Google decided to shut down Gmail. What would you do?",
    "companies": [
      "google"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "What steps would you take to handle customer feedback about bugs in features?",
    "companies": [
      "other"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "How would you go about building an online business that sells homemade cookies?",
    "companies": [
      "google"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "Tell me about a SaaS product you really like using.",
    "companies": [
      "salesforce"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "Tell me about a product that is useful but unprofitable.",
    "companies": [
      "google"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "How does the mean and median compare for search response times in Google?",
    "companies": [
      "google"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "What are the key components of a PRD?",
    "companies": [
      "uber"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "Tell me about a great product you've recently encountered and why you like it.",
    "companies": [
      "google"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "You have to launch an Uber Rider pass in your city. What should be the price of the pass?",
    "companies": [
      "uber",
      "lyft"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "As a PM for Medium, how would you integrate commercial platforms such as an online ticket booking, game voucher, and online shopping by positioning Medium as an online media? (Just imagine Medium already has those commercial products.)",
    "companies": [
      "medium"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "Why is Microsoft Outlook your favorite MS product?",
    "companies": [
      "microsoft"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "Explain Artificial Intelligence to your grandmother.",
    "companies": [
      "sofi"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "What is an area where Google is under invested?",
    "companies": [
      "google"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "Spotify generates a monthly report that gives details about the user's viewing time, genre, music composer, among others. Why do you think such a report is generated?",
    "companies": [
      "spotify"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "How would you make sure Amazon gives relevant results if a user types in the product details in local language?",
    "companies": [
      "amazon"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "How do you explain technical terms to laymen and to non-technical colleagues?",
    "companies": [
      "other"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "A Customer Success person told you that our magical super important tool is not working on the website, this is a bug! The button is supposed to open up a new page. But currently, clicking the button does nothing. i. What are the steps you would take to ensure that this issue gets resolved quickly ii. Write out any tickets etc you would use to solve this issue. iii. Discuss what stakeholders you would talk to and what conversations you would have to have to get this issue resolved.",
    "companies": [
      "other"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "What makes an event successful and how do you measure that success?",
    "companies": [
      "meta (facebook)",
      "microsoft"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "Google wants to invest in kids reading more audiobooks. How should they do it?",
    "companies": [
      "google"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "Give me a walk through to all the existing features of Instagram.",
    "companies": [
      "payu"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "How would you prioritize a tool v/s a feature?",
    "companies": [
      "other"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "How would you describe your dream PM job?",
    "companies": [
      "other"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "What is the role of a Product Manager in decommissioning a product? What are the steps involved?",
    "companies": [
      "other"
    ],
    "tags": [
      "other"
    ]
  },
  {
    "title": "Why did Facebook build the verified check badge?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "other"
    ]
  }
]