[
  {
    "title": "What metrics would you use to measure the success of the Save feature at Facebook?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Facebook Likes?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What metrics would you look at as a product manager for Instagram ads?",
    "companies": [
      "instagram",
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Identify one metric for Facebook Marketplace that the whole team should monitor daily.",
    "companies": [
      "meta (facebook)",
      "walmart",
      "paypal"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You launched a new feature that determines whether a Facebook message was read by a recipient. What metrics would you collect? How would you know the feature was a success?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What is the most important metric for Google Docs and why?",
    "companies": [
      "google",
      "coinbase"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What is the most important metric for Uber Eats? Why?",
    "companies": [
      "uber",
      "walmart",
      "flipkart",
      "coinbase"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What success metrics would you use to measure a payment gateway product?",
    "companies": [
      "paypal",
      "paytm",
      "amazon pay",
      "gopay",
      "grabpay"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How do you measure success of the Facebook Fundraising feature?",
    "companies": [
      "meta (facebook)",
      "coinbase"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What metrics would you use to track the improvement of sense of community within Facebook Groups?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What are the success metrics for Facebook Live at the growth phase?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Around 40% of reviews in Amazon are fake. As a PM in Amazon, how will you tackle the problem? Break your answer into 3 parts — 1. How will you identify a review is fake? 2. What action will you take? 3. If the number of fake reviews are decreased, what will be the impact?",
    "companies": [
      "google",
      "uber",
      "walmart",
      "flipkart"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are PM of FB Events and you saw an overnight drop in RSVPs by 10%. How would you go about determining what happened?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Google Photos?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What goals would you set for a Facebook Dating feature?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you evaluate the success of Instagram Stories?",
    "companies": [
      "instagram",
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the PM of the Facebook timeline. How would you measure retention?",
    "companies": [
      "meta (facebook)",
      "paypal"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you evaluate the success of Reactions in Facebook?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You're the PM for Facebook Pay. What goals would you define and what metrics would you track to measure your team's success?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the PM of Instagram stories. What goal would you set and how would you measure success?",
    "companies": [
      "meta (facebook)",
      "instagram"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Uber Ride?",
    "companies": [
      "uber",
      "lyft",
      "flipkart"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Gmail?",
    "companies": [
      "google",
      "flipkart"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How do you define success for Yelp reviews?",
    "companies": [
      "google",
      "walmart",
      "yelp"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are a PM for an e-commerce company. Due to some mistakes, the data team lost all key metrics. What are the metrics you will track as PM?",
    "companies": [
      "amazon",
      "flipkart",
      "walmart"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Google Calendar?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the PM who launched Instagram videos. What would be the goals and what would be the success metrics?",
    "companies": [
      "meta (facebook)",
      "instagram"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Imagine you were in charge of Facebook Watch. What metric would you want to measure?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "You are the PM of Facebook Lite. What goals would you set?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "Imagine you are the PM in charge of Reactions on Facebook - the new way to interact with posts by using “love”, “haha”, “wow”, “sad”, and “angry” reactions. What would success look like in terms of number of non-like reactions per post at launch and how do you come up with this? Would this number differ by reaction? Why or why not?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Users are having decision fatigue on the Uber Eats food delivery app. What kind of success metrics would you use to check the impact?",
    "companies": [
      "uber",
      "walmart"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How should you decide whether to autoplay videos on the newsfeed? What are the metrics for success?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What metrics would you look at to evaluate LinkedIn's success?",
    "companies": [
      "linkedin"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Late deliveries lead to customer churn. What data we should look at to prove this hypothesis for a food delivery app?",
    "companies": [
      "uber",
      "walmart",
      "lyft",
      "paypal"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you determine success for the Facebook profile verification checkmark?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What is the most important metric for Slack and why?",
    "companies": [
      "paypal",
      "slack"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Uber Grocery?",
    "companies": [
      "uber",
      "walmart",
      "flipkart",
      "dropbox"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the PM of the \"Share\" feature on Facebook. How would you measure the success of this feature?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you go about setting goals for Instagram hashtags?  ",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of YouTube?",
    "companies": [
      "google",
      "netflix",
      "dropbox",
      "spotify"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You're the PM for a new Meta product called Audio Rooms. What goals would you set for this product?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Pick a feature from a product of your choice & tell us how will you assess the success of that feature. Assume it is being launched now.",
    "companies": [
      "google",
      "meta (facebook)",
      "amazon",
      "flipkart",
      "linkedin",
      "instagram",
      "netflix"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are a PM for Facebook Events currently focused on growth. What would be your North Star metric?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Consider there is a company say LinkedIn. Which are the top three metrics you would see first thing in the morning?",
    "companies": [
      "linkedin",
      "paypal",
      "startup"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure improvements made to Facebook messenger?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of the Netflix recommendation engine?",
    "companies": [
      "dropbox",
      "netflix"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you set the goal for FB's Crisis Response feature?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "You are part of Reddit Product Management team. How would you measure the success of Reddit?",
    "companies": [
      "reddit"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "If you were the PM for Lyft, what dashboard would you build to track the health of the app?",
    "companies": [
      "google",
      "meta (facebook)",
      "uber",
      "lyft"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Facebook Friends feature?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Set goals for Facebook notifications.",
    "companies": [
      "meta (facebook)",
      "spotify"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Instagram is launching video calling. How would you test and measure its success?",
    "companies": [
      "meta (facebook)",
      "instagram"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the PM for Facebook, Instagram. You want to add new \"Mute showing food\" feature. How do you measure success?",
    "companies": [
      "instagram",
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the PM for Facebook Pages. What features would you prioritize?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What metrics would you track if you were PM of Facebook Birthdays?",
    "companies": [],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What do you think is the most important metric to track in Google Search and why?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How do you define the goals and metrics for Facebook Newsfeed?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What are the important metrics a PM for a luxury goods eCommerce website should look at?",
    "companies": [
      "google",
      "paypal",
      "shopify"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you change the Amazon Fresh experience and how would you measure them?",
    "companies": [
      "amazon"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Which metrics would you track for Uber Pool during the first 6 months after product launch?",
    "companies": [
      "uber"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the performance and health of a Netflix Original?",
    "companies": [
      "microsoft"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What metrics would you use to measure notifications at Facebook?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What goals would you set for Instagram Reels, as an Instagram Reels product manager?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What would be the top six metrics for WhatsApp? Now pick one from the six. Tell me three things you would do to improve that metric.",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you find if a customer is brand agnostic or not when shopping?",
    "companies": [
      "amazon",
      "flipkart",
      "ebay"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Facebook is running a test where they hide the like/comment/share bar of each Newsfeed post in the ellipses menu (3 dots in the corner) to increase the density of the feed. What metrics do you expect to move? How do you decide to fully roll out the feature?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you define success for Facebook Shops?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "How would you describe and assess how the Uber Marketplace (the matching platform) is doing, for UberX?",
    "companies": [
      "uber"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the PM for Amazon's cart page. How would you build a dashboard to measure success?",
    "companies": [
      "amazon",
      "walmart"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Make an argument for offering some free storage space to Google Photos users.",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Define the metrics for YouTube search.",
    "companies": [
      "google",
      "youtube",
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "Instagram recently decided to hide like counts on posts. How would you measure the success of this new feature?",
    "companies": [
      "instagram"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Facebook's DAU is decreasing 15% per week from the last 3 weeks. Find out why.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Facebook is launching a money transfer feature. What would you choose as success metrics?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What metrics would you track to increase the content consumption of Spotify by ten times?",
    "companies": [
      "coinbase"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How do you measure the success of Google Search?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What metrics would you chose for TikTok Live?",
    "companies": [
      "google",
      "meta (facebook)",
      "tiktok"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What data points would you would like to track to know if zoom meeting was successful or not?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What goals would you set for Facebook Jobs?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How do you measure the success of the Hot Home feature in Redfin?",
    "companies": [
      "redfin"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "What are the key metrics to be captured for a streaming service product?",
    "companies": [
      "netflix",
      "spotify",
      "nbc"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What metrics do you think are most important for evaluating the success of Facebook’s Workplace product?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the PM for privacy and security at Facebook. What goal would you set and how would you measure success?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "Suppose that you're the Chief Product Officer of Swiggy (an Indian food delivery app). What are the top 3 metrics that you would track?",
    "companies": [
      "flipkart"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Imagine you are the head of Product at AirBnb. What are the top 2-3 metrics you would monitor?",
    "companies": [
      "dropbox"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you test the LinkedIn feature \"People you may know\" when you don't have any data to base your decision off of?",
    "companies": [
      "linkedin"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Let's say that Facebook would like to change the user interface of the composer feature (the posting box) to be more like Instagram. Instead of a box, Facebook would add a \"+\" button at the bottom of the page. How would you test if this is a good idea?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How do you measure the success of Airbnb online experiences?",
    "companies": [
      "google",
      "airbnb",
      "spotify"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Facebook wants to split its newsfeed into two. What metrics would you look at to validate this decision?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are a PM for Instagram stories. You are considering increasing the expiration time of the stories. What metrics would you look at to make this decision?",
    "companies": [
      "meta (facebook)",
      "instagram"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How do you measure the success of Instacart?",
    "companies": [
      "google",
      "meta (facebook)",
      "dropbox"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Say you're the PM of Facebook and you have launched a new feature X with 20% engagement. How will you know if the overall engagement of Facebook has increased/decreased or remained same?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure success if you were to build a Facebook Events feature from scratch?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Google Hangouts?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you assess the opportunity for showing \"You may also like\" block along with the existing ads block on Google Shopping?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "I ran an A/B test on Instagram. It resulted in a 10% increase in usage for Instagram stories and a 10% decrease in overall usage for Instagram. As a product manager, what metrics will you ask from me to make trade-offs on the A/B test?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "As the product manager responsible for Facebook's newsfeed, your task is to increase the number of posts users see per day. To test this, the company conducted an A/B test with a randomized 1% sample of the population. Which metrics would be affected by this change, and what type of data should you anticipate as a result?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Imagine you are a PM of Uber's search map. How would you calculate its success?",
    "companies": [
      "uber"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Define success metrics for Facebook Messenger Kids.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics",
      "execution"
    ]
  },
  {
    "title": "You are the Product Manager at Netflix. What will be the top 3 metrics you will focus on and why?",
    "companies": [
      "cred"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Twitter - DAU dropped from 70% to 60%. Why?",
    "companies": [
      "monday.com"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Shopify addressed user needs by opening its platform to 3rd party developers for app creation. Your team is developing the Shopify App Store, facilitating app discovery/installation for merchants to boost business growth. What are the goals and success metrics of this marketplace?",
    "companies": [
      "shopify"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What is the North Star metric for a campaign to incentivize dormant users with a $10 credit?",
    "companies": [
      "uber"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Define success metrics for Android OS.",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Set goals for Facebook Stories.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What goals would you set for the Reels recommendation engine?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Facebook Newsfeed engagement is down 10%. How would you report this issue to the CEO?",
    "companies": [
      "google",
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What types of metrics do you use for measuring the success of products?",
    "companies": [
      "indeed"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Which success metrics would you want to track for Instagram Shopping?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "What metrics would you look into when Amazon is losing 10% of its revenue monthly?",
    "companies": [
      "flipkart"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What is the success metric for Airbnb's booking experience?",
    "companies": [
      "uber",
      "lyft",
      "airbnb",
      "instacart"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Facebook Jobs?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "You just launched Instagram Video. How would you know if it is successful?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Let’s say we want to figure out for any Facebook user, who their best friend is so we can prioritize showing their content in the News Feed. What product signals and metrics (max 5) would you use to determine who a user’s best friend is?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What are the success metrics for Google Maps?",
    "companies": [
      "google",
      "flipkart",
      "dropbox"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What should be the goal for Facebook Live?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you define meaningful social interaction for Facebook? What metrics you would use to evaluate?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What are 10 important metrics for Spotify under engagement category? Which one would you improve? Why?",
    "companies": [
      "google",
      "spotify"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of the Facebook photo upload feature?",
    "companies": [
      "meta (facebook)",
      "instagram"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you set goals and measure success of Instagram stories? What will happen if too many stories are getting created instead of posts?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Uber Freight?",
    "companies": [
      "uber"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What's the north star metric for Google Calendar?",
    "companies": [
      "google",
      "coinbase"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You're the PM for Google Cloud storage. How would you measure success?",
    "companies": [
      "google",
      "dropbox"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you set goals for Instagram Reels? Pick your success metrics and walk me through your trade-offs.",
    "companies": [
      "instagram"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "What metrics would you focus on as the PM for YouTube?",
    "companies": [
      "youtube"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are PM of FB Login used by 3rd parties and you notice successful logins metrics is down on a Monday morning. What will you do?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of YouTube TV?",
    "companies": [
      "youtube",
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What are the goals for Facebook's Newsfeed?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "Engagement is going down by 10% month on month for your product. What data /metrics would you look at?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are a PM at Spotify Podcast. What would be your success metrics?",
    "companies": [
      "spotify"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are a PM at Meta Pay. How are you going to measure success?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Pick your favorite product, and as the product manager, determine the daily dashboard you will need to run the product business.",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you set the goals/metrics for Uber Eats (pre-launch)?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "You are a product manager for online marketplace for pre-owned bicycles. CEO has identified three goals. 1. Build high trust between buyers and sellers 2. Create a viral marketplace and 3. Present the best portfolio of bicycles. What are the KPIs for each of the three goals?  ",
    "companies": [
      "uber",
      "yulu bikes"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Define the success metrics for the United States and set goals for the next 10 years.",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Target online is launching a new feature to show suggested items when a person is on a product page online. What will be the launch metrics?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the PM at Meta. How would you define success metrics for Facebook Reels, and why was Facebook Reels launched?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You're the product manager at Spotify. Build metrics.",
    "companies": [
      "spotify",
      "coinbase"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "You're the PM for Instagram Shopping. What 3-5 metrics would you want to track?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "How would you measure the satisfaction of hosts on Airbnb?",
    "companies": [
      "airbnb"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the Product Manager for Video calls on Messenger. How would you set goals?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "You are the PM for ad products within Meta, specializing in offline shops. How will you measure the success of the product?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "If you are designing an app for setting meetings, how will you set and prioritize metrics for it?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "If you were the Senior PM at Uber, how would you define the metrics and north star of your team before leaving for a 2-month break?",
    "companies": [
      "uber"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You’re a PM at Meta, launching a new feature for audio-only posts for stories. What metrics would you measure?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Choose a Fintech product and discuss its business objectives and key performance indicators (KPIs).",
    "companies": [
      "coinbase"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the Product Manager for the Meta food delivery app. What two goals would you discuss with higher executives regarding success?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "What are the success metrics for an app-based taxi aggregator (competitor of Uber) during the initial phase?",
    "companies": [
      "uber"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of stripe check out page?",
    "companies": [
      "stripe"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are a PM at Instagram. How will you measure the success of Instagram shop?",
    "companies": [
      "flipkart"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Your team is proposing removing the profile photo upload step in the onboarding flow. What metric would you look at?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Zoom has introduced a new feature that allows users to send emoji reactions during meetings. How would you assess the effectiveness of this new feature?",
    "companies": [
      "zoom"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you set goals and measure success for Whatsapp polls? Please walk us through your thinking process.",
    "companies": [
      "whatsapp"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the product manager for the 'verified' feature of Instagram. How do you measure success?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you determine success for the \"Things to do\" feature in Airbnb?",
    "companies": [
      "airbnb"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Messenger Rooms?",
    "companies": [
      "microsoft"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "It's back in 2011 and you're thinking of launching Facebook Events. What metrics would you set up as a goal for your team?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Define success metrics for the Airbnb traveler booking experience.",
    "companies": [
      "airbnb",
      "instacart"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What are the goals and metrics for video conferencing apps? (Google Meet, Zoom, etc.)",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you set goals for bikers using Google Maps?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Describe the metrics you would use to see if the product you are launching will be a success or not.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure success for Facebook Rooms?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Facebook Marketplace?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You're the PM of Facebook Birthdays. Birthday greetings drop one day; what do you do?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure customer success for a newly launched product?",
    "companies": [
      "zoom"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Shazam?",
    "companies": [
      "google",
      "dropbox"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Why do Facebook Marketplace exist? What are its goals?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics",
      "product-strategy"
    ]
  },
  {
    "title": "How do you measure success of Google Maps in shopping mall?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the effectiveness of our employee referral program?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Lyft Shuttle?",
    "companies": [
      "swiggy"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What would you define as the goals for Facebook's new user experience?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "How could you use logs to determine if a new product is successful?",
    "companies": [
      "google"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "What are the metrics for Google Photos?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "If you were the PM in charge of the Google Pixel's camera app, how would you measure your success?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you define success metrics for Facebook Pages?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "Define goals for a handheld gaming device for facebook. Follow up question: after 6 months, you see WAU increasing by 10% but session length decreasing by 12%, then would you still ship it?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics",
      "problem-solving"
    ]
  },
  {
    "title": "What metrics would you use to measure success in designing the estimated time of arrival?",
    "companies": [
      "uber",
      "lyft",
      "dropbox"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What is the north star metric for Yelp?",
    "companies": [
      "yelp"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you go about validating the need for an app to split the bill when people go out to restaurants or bars?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "The users of a mobile app complain that the app is slow. As a product manager, what will you do about it?",
    "companies": [
      "zillow"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What metric would you track for Lyft's debit card program?",
    "companies": [
      "lyft"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "How would you measure success for a Facebook travel recommendation product?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "What are the top 3 metrics you would track for Quora?",
    "companies": [
      "quora"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you sell an employee training service to employers?",
    "companies": [
      "sofi"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the product manager for Instagram stories. How would you measure success at launch?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Medium?",
    "companies": [
      "twitter"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What is the goal for Facebook Lite?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "Amazon just started a pharmacy business. How would you ensure success of the business?",
    "companies": [
      "amazon"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the PM for a COVID-19 information portal. What are the goals that you will set for the team?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You’re the PM for an e-commerce marketplace and you’re responsible for the recommendations feature. In the past quarter, you ran an A/B test for your new feature and you’re supposed to present the results to the execs. What metrics would you present to them?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you set the success metrics of Facebook Dating?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Define the success metrics for videos on the Facebook Newsfeed.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You’re the PM for a social media company. You are owning a new feature that allows video sharing (like YouTube ). What would you pick as your success metric?",
    "companies": [
      "other"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "What metrics will you use to calculate the happiness index of customers for the Medium blog?",
    "companies": [
      "medium"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Walmart+?",
    "companies": [
      "other"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would measure the success of LinkedIn Jobs?",
    "companies": [
      "linkedin"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of iPad Pro?",
    "companies": [
      "paypal",
      "apple"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Facebook Posts feature?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What are the metrics you will track if you own Google Docs?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Uber Instant Pay?",
    "companies": [
      "uber",
      "lyft",
      "coinbase"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What metrics would you take into consideration for Instagram's swipe left to open camera to post a new picture? Pick one or two metrics and provide the reasons for picking them.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Imagine Facebook doesn't have any marketplace product and you have been tasked to build it. What is your mission, goal and success metrics?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What goals and success metrics would you set for buy & sell groups?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What KPIs do you think Gmail monitors?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What would be the next big feature you would launch on Uber to improve Customer Retention and Average Spend?",
    "companies": [
      "uber",
      "lyft"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "As a Product Manager for Fitbit, what would be a metric you would care about and why? How will you implement a feature to improve that metric?",
    "companies": [
      "fitbit"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you get Sales Professionals to post more links on LinkedIn? What metrics would you look at?",
    "companies": [
      "linkedin"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of Instagram's activity feed?",
    "companies": [
      "instagram"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What is your favorite game? What feature would you create for this game? What metrics would you look at to determine if this is worthwhile, before spending a single engineering dollar?",
    "companies": [
      "zynga"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You're a PM at Cloudera and launching in a new market. How would you know that your product launch is successful?",
    "companies": [
      "cloudera"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "It's Instagram in 2013. How would you define success for the team whose charter is to build the first API?",
    "companies": [
      "meta (facebook)",
      "instagram"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "As a PM candidate, how would you measure if LinkedIn is better for iOS or android, given that the look and feel is same across both platforms?",
    "companies": [
      "linkedin"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you design an iron for a blind person?",
    "companies": [
      "twitter"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure success of Twitter Lists?",
    "companies": [
      "twitter"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What would be the metrics that you'll focus on to launch YULU bikes in Tier 2 cities?",
    "companies": [
      "yulu bikes"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How do you know your product is creating value? How do you know if a particular feature or enhancement is creating value? Is it possible to create negative value?",
    "companies": [
      "other"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What metrics do you think are important to Yelp?",
    "companies": [
      "yelp"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you set a goal for Life Events on Facebook?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Set a goal for Facebook groups admins.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Imagine that in your daily routine of checking conversion funnel, you realize a 20% drop in checkout funnel. What would you do?",
    "companies": [
      "amazon"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you decide where to establish a Pizza restaurant?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the PM for a certain feature. What dashboard would you build to monitor its effectiveness? What metrics would it include?",
    "companies": [
      "lyft"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you decide if Facebook should invest in the space of Volunteering? Set the success metrics.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure success for Facebook Events?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What are product success metrics for the Uber Split Fare and how you measure it?",
    "companies": [
      "uber",
      "lyft",
      "flipkart"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the product manager for Lyft Direct Debit Card for drivers. The product just launched. How do you build this product's first dashboard?",
    "companies": [
      "uber",
      "lyft"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "We're launching hashtags on Instagram for the first time. What are your goals?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You have received bad press about our product. What is the first set of metrics that you would review?",
    "companies": [
      "nbc"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the product manager for a News App. What metrics will tell you that you should discontinue the product?",
    "companies": [
      "sony entertainment"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure engagement for Netflix?",
    "companies": [
      "spotify",
      "instagram",
      "netflix"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "If you were the head of product at AirBnB, what metrics would you look at to determine success over a 2-year time horizon?",
    "companies": [
      "dropbox"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What is the best metric to track projects in that are in a tight schedule.",
    "companies": [
      "t-mobile"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Suppose you're the PM of an API that can analyse and categorize user's spends. What are the key metrics you would track to measure the success of this feature?",
    "companies": [
      "paypal"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the product manager for Facebook News. What success metric would you track and why?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "How will you evaluate the option of making a profile picture optional during user signup?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "How would you measure the success of stripe billing?",
    "companies": [
      "stripe"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Set goals for Facebook Pages.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "How would you set the goals/metrics for a home services product like Angie's List?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "You are the PM for FB Story. What metrics would you pick for success?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "execution",
      "metrics"
    ]
  },
  {
    "title": "How would you prioritize the features if a situation is given as follows",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "As a PM, what metrics would you consider for YouTube homepage?",
    "companies": [
      "american express"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You have seen a 10% decrease in total bookings on Airbnb this month. What will you do?",
    "companies": [
      "airbnb"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You're the product manager focused on retention at Instacart. How do you decide what to work on?",
    "companies": [],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are a product manager on the new product experiences team (e.g. LGBT couples adopting a child, career advice for children of color, etc). How will you set goals for the product?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Measure the success of Facebook Campus.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Set goals for Instagram shops.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you measure success of the PVP feature in Pokemon Go?",
    "companies": [
      "niantic"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you define the goals and metrics for a live voice channel feature (like Facebook/Instagram live, but only voice-powered)?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "How would you define the goals for the unauthenticated (login) page of Facebook?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What's your favorite video-calling product? How would you define success metrics and goals for it?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Facebook is launching a new headset with smart capabilities. How do you measure its success?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What would be your approach to validating an idea for a borrowing and lending product, and how would you go about building it?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "product-design",
      "metrics"
    ]
  },
  {
    "title": "What are the success metrics for Facebook Rooms?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the Product Manager of Instagram Reels, and you have just released it to 150 countries. Set goals and success metrics for Instagram Reels.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics",
      "execution"
    ]
  },
  {
    "title": "Measure the success of the save feature in LinkedIn.",
    "companies": [
      "linkedin"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "You are the Head of Product for DoorDash. What would be your North Star metric that you would track? Additionally, what are the other top metrics you would prioritize?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Define success metrics for Local Ads.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "What evaluation metrics can be used to judge LLM generation quality in your AI Products?",
    "companies": [
      "google"
    ],
    "tags": [
      "metrics"
    ]
  },
  {
    "title": "Given a situation where you are a PM for a TravelTech company, what is one metric that you would build for the product leadership team?",
    "companies": [
      "microsoft"
    ],
    "tags": [
      "metrics"
    ]
  }
]