[
  {
    "title": "How would you increase the number of comments in Facebook groups?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "How would you grow the number of Instagram users?",
    "companies": [
      "meta (facebook)",
      "instagram"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "What would be your strategy to bring partners onto the Facebook platform for Black Friday?",
    "companies": [
      "meta (facebook)",
      "stripe"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "If you are in Netflix, what you do to help Netflix grow 10x in India? Why do you feel Netflix has not grown in India.?",
    "companies": [
      "netflix"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "How would you increase the basket size of different products for users?",
    "companies": [
      "amazon"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "You are a PM of Microsoft Edge. How will you identify the potential areas which can help to increase the market share of Edge?",
    "companies": [
      "microsoft"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "How would you increase the revenue of Google Maps?",
    "companies": [
      "google"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "Netflix's subscription renewal rate is declining year over year. What hypotheses would you propose, and how would you validate them?",
    "companies": [
      "netflix"
    ],
    "tags": [
      "product-growth",
      "problem-solving"
    ]
  },
  {
    "title": "How would you increase the number of monthly active advertisers on Instagram?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "The Netflix marketing team observed that there are many people ordering food when they are watching movies on Netflix. What is the Product Manager's take on this?",
    "companies": [
      "netflix"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "How would you ideate, scope and execute a new partnership (partner) for Facebook Marketing Partners Program?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "You need to increase Acquisition for a Subscription based SaaS product in virtualization space. What product growth model would be useful?",
    "companies": [
      "airbnb"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "If you were a senior PM for Google Maps, what would your goal be for the next year?",
    "companies": [
      "meta (facebook)",
      "google"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "Increase the number of WhatsApp downloads.",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "How would you create a localization strategy/roadmap for a product?",
    "companies": [
      "google"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "How would you grow revenue on Yelp for Business?",
    "companies": [
      "yelp"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "You are a Growth Product Manager at Earnest focusing on acquisition, top of the funnel metrics. How would you engage and acquire more students to sign up for student loan at Earnest?",
    "companies": [
      "earnest"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "Shopify has launched NFT marketplaces. Assume you are the Growth Manager for this feature/product. Flesh out a detailed GTM/Growth strategy for this launch. Assume your goal is to get to 1000 customers.",
    "companies": [
      "shopify",
      "american express"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "Slack recently launched SlackShare, a competitor to Loom. You lead the Growth Charter for Loom and are seeing a steady decline in usage of the core Loom product because of this launch by Slack. Devise a growth strategy that turns around this decline in usage of Loom. Cover: 1. Segmentation, Targeting and Positioning 2. How will you drive adoption? 3. Success criteria and Metrics",
    "companies": [
      "paypal",
      "slack"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "How would you improve female participation on a fantasy gaming platform?",
    "companies": [
      "other"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "How would you increase trust in a new fintech app that allows users to transfer money across countries, for example, from a person in the US (in dollars) to a person in India (in rupees)?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "product-growth",
      "product-improvement"
    ]
  },
  {
    "title": "How do you grow the total number of users in mobile app sign-ups, and what strategies would you implement to increase user acquisition?",
    "companies": [
      "meta (facebook)"
    ],
    "tags": [
      "product-growth"
    ]
  },
  {
    "title": "You are a Product Manager at Apple and have been tasked with doubling the revenue of a specific product within 12 months. What actions do you take?",
    "companies": [
      "walt disney"
    ],
    "tags": [
      "product-growth"
    ]
  }
]